#!/usr/bin/env bash
#############################################################################################
##程序描述：监控测试
##实现功能：
##运行周期：
##创建作者：
##创建日期：2022-07-01
#############################################################################################

######################################################################
##参数设置
######################################################################
##判断系统是windows还是Linux
system_name=`uname`
##路径
FWDIR="$(cd `dirname $0`;pwd)"
##引入工具类
if [[ ${system_name} =~ "MINGW64_NT" ]]; then
  TOOL_PATH=${FWDIR}/../../utils/
else
  TOOL_PATH=${FWDIR}/utils/
fi
. ${TOOL_PATH}/tool.func

fun_log 0 "test..." >> ${FWDIR}/log.tmp