#!/usr/bin/env bash
######################################################################
##资源服务化造数据，定时执行hive sql
##
##参数1 keytab对应的用户名，示例：yz_newland
##参数2 队列，示例：root.yz_newland
##参数3 sql，示例：select count(1) from test1
##
##正常任务
##sh /bi/app/script/rsmgr_job_test.sh yz_newland root.yz_newland "select count(1) from test1"
##sh /bi/app/script/rsmgr_job_test.sh qz_edc_u root.qz_edc.qz_edc_p "select count(1) from qz_edc_ops.qz_test"
##常驻任务，资源不足跑不动
##nohup sh /bi/app/script/rsmgr_job_test.sh fz_edc_u root.fz_edc.fz_edc_p "insert into fz_edc_ops.fz_test(id) values(1)" >/dev/null 2>&1 &
######################################################################


######################################################################
##参数格式判断(自定义)：判断参数个数是否符合要求
######################################################################
if [[ $# -lt 3 ]]; then
	echo "参数个数不足3个：1.keytab对应的用户名 2.队列 3.sql";
	exit 1;
fi


######################################################################
##脚本传入参数转变量赋值(自定义)：将传入的参数改成脚本中使用的变量，统一使用小写
######################################################################
#keytab对应的用户名
keytabName=${1};
#队列
queueName=${2};
#sql
sqlStr=${3};


######################################################################
##脚本传入参数转变量打印(自定义)：打印脚本传入的各个变量参数
######################################################################
echo "----------------------------------打印参数信息-----------------------------";
echo "keytab对应的用户名:"${keytabName}
echo "队列:"${queueName}
echo "sql:"${sqlStr}


######################################################################
##脚本开始处理标志(模板)
######################################################################
echo "--------------------------------开始脚本逻辑处理--------------------------------";
##执行开始时间
begin_time=`date +"%s"`;


######################################################################
##加载环境变量，刷新票据
######################################################################
source /opt/client/bigdata_env;
#先判断是否有这个认证文件
if [[ ! -f /bi/app/hacluster/keytab/${keytabName}.keytab ]]; then
	echo "对应的文件不存在/bi/app/hacluster/keytab/${keytabName}.keytab，请检查！";
	exit 1;
fi
export KRB5CCNAME=/bi/app/hacluster/krb_cache/${keytabName}
kinit -kt /bi/app/hacluster/keytab/${keytabName}.keytab ${keytabName}@HADOOP.COM
#时间
echo "----------------------------------执行时间----------------------------------"
echo "`date '+%Y-%m-%d %H:%M:%S'`"
#打印当前票据
echo "----------------------------------打印当前票据----------------------------------"
klist;


######################################################################
##执行hive
######################################################################
exechive_bee()
{
echo "----------------------------------执行hive----------------------------------"
beeline << EOF
SET mapreduce.job.queuename=${queueName};
${sqlStr};
EOF
RESULTCODE=$?;
echo ""
return $RESULTCODE;
}


######################################################################
##通用函数(模板)：各脚本使用的通用函数，不够的在模板中添加
######################################################################
##返回结果处理
_exit()
{
	if [[ ${1} -eq 0 ]] ; then
		echo "--------------------------------脚本逻辑处理结束--------------------------------";
		##执行结束时间
		end_time=`date +"%s"`;
		##执行耗时
		elapse=$((${end_time}-${begin_time}));
		echo "脚本执行耗时:${elapse} s";
		exit 0;
	else
		echo "--------------------------------脚本逻辑处理失败--------------------------------";
		exit 1;
	fi;
}


######################################################################
##main
######################################################################
exechive_bee


######################################################################
##脚本结束处理标志(模板)
######################################################################
_exit 0;
