#!/usr/bin/env bash
#############################################################################################
##程序描述：模拟《家宽六期访问日志上报预处理脚本》
##实现功能：参数打印
##运行周期：15分钟
##创建作者：
##创建日期：2019-12-30
#############################################################################################
echo "【qry_hbrand_report_j】【1】${1}"
echo "【qry_hbrand_report_j】【2】${2}"
echo "【qry_hbrand_report_j】【3】${3}"
echo "【qry_hbrand_report_j】【4】${4}"
echo "【qry_hbrand_report_j】【5】${5}"
echo "【qry_hbrand_report_j】【6】${6}"