#!/bin/sh
#####################################################
##程序描述：校验redis集群密码配置情况
##实现功能：校验redis集群密码配置情况，需要ips.txt文件，一行一个ip:端口，第一行是密码
##运行周期：无
##创建作者：cqx
##创建日期：2023-01-30
#####################################################
#####################################################
##版本信息：版本注释，描述修改内容：
#####################################################
##版本号：
##修改日期：
##修改内容：
##修改人员：
#####################################################


#####################################################
#开发环境ips.txt
#####################################################
#by7JqR_k
#10.1.8.200:10010
#10.1.8.200:10011
#10.1.8.201:10010
#10.1.8.201:10011
#10.1.8.202:10010
#10.1.8.202:10011
#10.1.8.200:30010
#10.1.8.200:30011
#10.1.8.201:30010
#10.1.8.201:30011
#10.1.8.202:30010
#10.1.8.202:30011


##路径
FWDIR="$(cd `dirname $0`;pwd)"
echo "script path is ${FWDIR}"
echo "" > ${FWDIR}/tmp_all

##校验ips.txt文件
if [[ ! -e ${FWDIR}/ips.txt ]]; then
	echo "ips.txt文件不存在，请创建一个"
	echo "格式如下："
	echo "第一行是密码"
	echo "后面每一行都是IP:PORT"
	echo "============================="
	echo "示例"
	echo "============================="
	echo "123456"
	echo "192.168.0.1:10000"
	echo "192.168.0.1:10001"
	exit -1;
fi

##读取第一行的密码
_password=`head -1 ${FWDIR}/ips.txt`
echo "password: ${_password}"

##跳过第一行，第一行是密码
for ip in `tail -n +2 ${FWDIR}/ips.txt`
do
_h=`echo ${ip}|awk -F ':' '{print $1}'`
_p=`echo ${ip}|awk -F ':' '{print $2}'`
#####################################################
#生产环境
#####################################################
#edc_redis@10.48.134.136
#客户端/usr/local/bin/redis-cli
#脚本部署路径/home/edc_redis/script
#####################################################
#开发环境
#####################################################
#redis@10.1.8.200
#客户端/home/redis/redis627/redis/src/redis-cli
#脚本部署路径/home/redis/redis627/bin
#####################################################
/home/redis/redis627/redis/src/redis-cli -c -h ${_h} -p ${_p} -a ${_password} << EOF > ${FWDIR}/tmp
acl list
EOF
_tmp=`cat ${FWDIR}/tmp`
echo "ip ${_h} port ${_p} ${_tmp}" >> ${FWDIR}/tmp_all
done

cat ${FWDIR}/tmp_all
rm ${FWDIR}/tmp
rm ${FWDIR}/tmp_all
